Tekla Open API Reference for Tekla Structures 2025
CrossSection Properties
The CrossSection type exposes the following members.
Properties
Name | Description
HighAccuracy
 The contour geometry accuracy.
InnerSurfacePoints
 Gets the points for inner surfaces.
InnerSurfaces
 Gets the cross section points for inner surfaces.
Length
 The total length
Location
 The location in relation to length, 0.0 referring to start of the profile
OuterSurface
 Gets the cross section points for outer surface.
OuterSurfacePoints
 Gets the cross section points for outer surface.
Profile
 The profile where cross section is asked from
Top
See Also
Reference
CrossSection Class
Tekla.Structures.Catalogs Namespace